app/controllers/memos_controller.rb

SELECT "memos".* FROM "memos" WHERE "memos"."user_id" = ?  [["user_id", 4]]
---
  def index
    @memos = current_user.memos.all

INSERT INTO "memos" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ashkdfg"], ["content", "skjdh\r\n"], ["created_at", 2016-12-11 22:43:41 UTC], ["updated_at", 2016-12-11 22:43:41 UTC], ["user_id", 4]]
---
  def create
    @memo = current_user.memos.new(memo_params)

    respond_to do |format|
      if @memo.save

SELECT  "memos".* FROM "memos" WHERE "memos"."user_id" = ? AND "memos"."id" = ? LIMIT ?  [["user_id", 4], ["id", 2], ["LIMIT", 1]]
---
    def set_memo
      @memo = current_user.memos.find(params[:id])