app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "sa"], ["email", "xp"], ["password_digest", "123"], ["created_at", 2016-12-11 20:58:07 UTC], ["updated_at", 2016-12-11 20:58:07 UTC]]